# 多尺度复杂背景无人机检测优化架构 - 最终版
nc: 1
depth_multiple: 0.33
width_multiple: 0.50
anchors:
  - [6, 8, 10, 13, 13, 16]      # P3/8 - 进一步优化极小目标
  - [16, 19, 23, 30, 33, 45]    # P4/16 - 中小目标
  - [62, 90, 119, 156, 198, 326] # P5/32 - 大目标

backbone:
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]],  # 2
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, C3, [256]],  # 4
    [-1, 1, EnhancedECA, []], # 5: 增强版ECA - 专为小目标优化
    [-1, 1, Conv, [512, 3, 2]], # 6-P4/16
    [-1, 9, C3, [512]],  # 7
    [-1, 1, Conv, [1024, 3, 2]], # 8-P5/32
    [-1, 3, C3, [1024]],  # 9
    [-1, 1, SPPF, [1024, 5]], # 10
  ]

head:
  [
    [-1, 1, Conv, [512, 1, 1]], # 11
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 12
    [[-1, 7], 1, Concat, [1]], # 13: P5上采样 + P4
    [-1, 3, C3, [512, False]], # 14: P4特征融合
    [-1, 1, LightweightCBAM, []], # 15: 轻量级CBAM

    [-1, 1, Conv, [256, 1, 1]], # 16
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 17
    [[-1, 5], 1, Concat, [1]], # 18: P4上采样 + P3(with ECA)
    [-1, 3, C3, [256, False]], # 19: P3特征融合
    [-1, 1, SmallTargetBooster, []], # 20: 小目标增强器

    [-1, 1, Conv, [256, 3, 2]], # 21: P3->P4下采样
    [[-1, 15], 1, Concat, [1]], # 22: P3下采样 + P4特征
    [-1, 3, C3, [512, False]], # 23: P4最终特征
    [-1, 1, ContextAwareAttention, []], # 24: 上下文感知注意力

    [-1, 1, Conv, [512, 3, 2]], # 25: P4->P5下采样
    [[-1, 10], 1, Concat, [1]], # 26: P4下采样 + P5特征
    [-1, 3, C3, [1024, False]], # 27: P5最终特征

    [[20, 24, 27], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]